#include "पर्वयन्त्रम्.h"

#include <malloc.h>
#include <stdio.h>

typedef पर्व *पर्वनिर्देशः;
typedef enum { साधारणत्वम्, प्रयोगत्वम्, तद्रूपत्वम् } पर्वभेदः;
typedef पर्वभेदः *पर्वभेदनिर्देशः;
typedef unsigned long int गणना;
typedef char द्वैधम्;

static पर्व शुद्धम्(const पर्वनिर्देशः);

#define सत् 1
#define असत् 0
#define भेदः(p) (* (पर्वभेदनिर्देशः) p)
#define सङ्ख्यानिर्देशः(p) (p + sizeof (पर्वभेदः))
#define वामनिर्देशः(p) (सङ्ख्यानिर्देशः (p) + sizeof (गणना))
#define दक्षिणनिर्देशः(p) (वामनिर्देशः (p) + sizeof (पर्व))
#define अतिदेशःनिर्देशः(p) (दक्षिणनिर्देशः (p) + sizeof (पर्व))
#define सङ्ख्या(p) (* (गणना *) (सङ्ख्यानिर्देशः (p)))
#define वामम्(p) (* (पर्वनिर्देशः) वामनिर्देशः (p))
#define दक्षिणम्(p) (* (पर्वनिर्देशः) दक्षिणनिर्देशः (p))
#define शुद्धवामम्(p) (शुद्धम् (वामनिर्देशः (p)))
#define शुद्धदक्षिणम्(p) (शुद्धम् (दक्षिणनिर्देशः (p)))
#define अतिदेशः(p) (* (पर्वनिर्देशः) अतिदेशःनिर्देशः (p))
#define असाधारणम्(p) (भेदः (p) != साधारणत्वम्)
#define प्रयोगः(p) (भेदः (p) == प्रयोगत्वम्)
#define तद्रूपम्(p) (भेदः (p) == तद्रूपत्वम्)
#define पर्वपरिमाणम् (sizeof (पर्वभेदः) + sizeof (गणना) + 3 * sizeof (पर्व))

#ifdef परीक्षणम्
int स्थानपरिमाणम् = 0;
#endif


द्वैधम् उपक्रान्तम् = असत्;
पर्व तद्रूपकम्, वामकम्, दक्षिणकम्, समत्वकम्, स्थानिकम्, अतिदेशकम्, प्रयोजकम्, बाह्यकम्;

static void क्षयः(const पर्व p, const द्वैधम् निःशेषतस्त्वम्)
{
	if (p && (!निःशेषतस्त्वम् || !--(सङ्ख्या(p)))) {

		#define अवयवक्षयः(a) क्षयः (a (p), 1)

		अवयवक्षयः(वामम्);
		अवयवक्षयः(दक्षिणम्);
		अवयवक्षयः(अतिदेशः);

		#undef अवयवक्षयः

		if (निःशेषतस्त्वम्) {
			free(p);

		#ifdef परीक्षणम्

			स्थानपरिमाणम्--;
			printf("%d\n", स्थानपरिमाणम्);

		#endif
		}
	}
}

static void आलम्बिक्षयः(const पर्व p)
{
	क्षयः(p, 1);
}

static void आलम्बिवृृद्धिः(const पर्व p)
{
	if (p)
		सङ्ख्या(p)++;
}

void मार्जनम्(const पर्व p)
{
	if (p && (p < तद्रूपकम् || p > तद्रूपकम् + 8 * पर्वपरिमाणम् || सङ्ख्या(p) > 1))
		आलम्बिक्षयः(p);
}

static void पर्वपर्ययः(const पर्व p, const पर्वभेदः b, const पर्व v, const पर्व d, const पर्व a, const द्वैधम् सक्षयत्वम्)
{
	भेदः(p) = b;
	आलम्बिवृृद्धिः(v);
	आलम्बिवृृद्धिः(d);
	आलम्बिवृृद्धिः(a);
	if (सक्षयत्वम्)
		क्षयः(p, असत्);
	वामम्(p) = v;
	दक्षिणम्(p) = d;
	अतिदेशः(p) = a;
}

static पर्व नवम्(const पर्वभेदः b, const गणना s, const पर्व v, const पर्व d, const पर्व a)
{
	पर्व p = malloc(पर्वपरिमाणम्);

	#ifdef परीक्षणम्

	स्थानपरिमाणम्++;
	printf("%d\n", स्थानपरिमाणम्);

	#endif

	सङ्ख्या(p) = s;
	पर्वपर्ययः(p, b, v, d, a, असत्);
	return p;
}

static पर्व नवसातिदेशप्रयोगः(const पर्व v, const पर्व d, const पर्व a)
{
	return नवम्(प्रयोगत्वम्, 0, v, d, a);
}

पर्व नवप्रयोगः(const पर्व v, const पर्व d)
{
	पर्व p = नवम्(प्रयोगत्वम्, 1, v, d, NULL);
	return शुद्धम्(&p);
}

पर्व नवपर्व(const पर्व v, const पर्व d)
{
	return नवम्(साधारणत्वम्, 1, v, d, NULL);
}

static void साधारणीकरणम्(const पर्व p, const पर्व v, const पर्व d)
{
	पर्वपर्ययः(p, साधारणत्वम्, v, d, NULL, सत्);
}

static void तद्रूपीकरणम्(const पर्व p, const पर्व t)
{
	पर्वपर्ययः(p, तद्रूपत्वम्, t, NULL, NULL, सत्);
}

static void प्रयोगपर्ययः(const पर्व p, const पर्व v, const पर्व d, const पर्व a)
{
	पर्वपर्ययः(p, प्रयोगत्वम्, v, d, a, सत्);
}

void उपक्रमः()
{
	if (!उपक्रान्तम्) {
		उपक्रान्तम् = 1;
		पर्व p = malloc(पर्वपरिमाणम् * 8);

		#define संस्कारः(s)\
			s = p;\
			p += पर्वपरिमाणम्;\
			सङ्ख्या (s) = 1;\
			पर्वपर्ययः (s, साधारणत्वम्, NULL, NULL, NULL, असत्)

		संस्कारः(तद्रूपकम्);
		संस्कारः(वामकम्);
		संस्कारः(दक्षिणकम्);
		संस्कारः(समत्वकम्);
		संस्कारः(स्थानिकम्);
		संस्कारः(अतिदेशकम्);
		संस्कारः(प्रयोजकम्);
		संस्कारः(बाह्यकम्);

		#undef संस्कारः
	}
}

static पर्व शुद्धम्(const पर्वनिर्देशः शोध्यनिर्देशः)
{
	पर्व s;
	while ((s = *शोध्यनिर्देशः) && असाधारणम्(s)) {
		if (प्रयोगः(s)) {
			const पर्व v = शुद्धवामम्(s);
			if (!v)
				तद्रूपीकरणम्(s, NULL);

			#define समत्वे(p) else if (v == p)

			समत्वे(तद्रूपकम्) तद्रूपीकरणम्(s, दक्षिणम्(s));

			#define असतिकार्यम्(p) if (! p)\
				तद्रूपीकरणम्(s, NULL);
			#define अवयवः(n, a)\
				समत्वे (n)\
				{\
					const पर्व d = शुद्धदक्षिणम् (s);\
					असतिकार्यम् (d)\
					else\
						तद्रूपीकरणम् (s, a (d));\
				}

			अवयवः(वामकम्, वामम्)
			अवयवः(दक्षिणकम्, दक्षिणम्)
			
			#undef अवयवः
			
			समत्वे(समत्वकम्) {
				const पर्व d = शुद्धदक्षिणम्(s);
				असतिकार्यम्(d)
				else {
					const पर्व dd = शुद्धदक्षिणम्(d);
					असतिकार्यम्(dd)
					else {
						const पर्व vd = शुद्धवामम्(d);
						if (!vd || शुद्धवामम्(vd) == शुद्धदक्षिणम्(vd))
							तद्रूपीकरणम्(s, वामम्(dd));
						else
							तद्रूपीकरणम्(s, दक्षिणम्(dd));
					}
				}
			}

			समत्वे(स्थानिकम्) {
				const पर्व a = अतिदेशः(s);
				प्रयोगपर्ययः(s, a, दक्षिणम्(s), a);
			}

			#undef समत्वे

			else
			{
				const पर्व vv = शुद्धवामम्(v);
				if (vv == अतिदेशकम्) {
					const पर्व dv = दक्षिणम्(v);
					प्रयोगपर्ययः(s, dv, दक्षिणम्(s), dv);
				} else if (vv == प्रयोजकम्) {
					const पर्व dv = शुद्धदक्षिणम्(v);
					असतिकार्यम्(dv)
					else {
						const पर्व d = दक्षिणम्(s), a = अतिदेशः(s);
						प्रयोगपर्ययः(s, नवसातिदेशप्रयोगः(वामम्(dv), d, a), नवसातिदेशप्रयोगः(दक्षिणम्(dv), d, a), a);
					}
				} else if (vv == बाह्यकम्)
					तद्रूपीकरणम्(s, दक्षिणम्(v));
				else {
					const पर्व d = दक्षिणम्(s), a = अतिदेशः(s);
					साधारणीकरणम्(s, नवसातिदेशप्रयोगः(vv, d, a), नवसातिदेशप्रयोगः(दक्षिणम्(v), d, a));
				}
			}
			
			#undef असतिकार्यम्
			
		} else if (तद्रूपम्(s)) {
			const पर्व t = वामम्(s);
			आलम्बिवृृद्धिः(t);
			आलम्बिक्षयः(s);
			*शोध्यनिर्देशः = t;
		}
	}
	return s;
}
