#ifndef पर्वयन्त्रम्_H
#define पर्वयन्त्रम्_H

/*
स्मृतौप्रतिपर्वनिर्वर्णनार्थङ्कोप्यवकाशआरक्ष्यते।
तस्यस्थानस्यनिर्देशेनैवतत्पर्वप्रत्यभिज्ञायते।
अतस्सएवनिर्देशःसर्वत्रपर्वप्रतिनिधित्वेनव्यवह्रियते।
पर्वप्रतिनिधित्वात्तादृक्सस्थाननिर्देशानाञ्जातिःपर्वेत्युच्यते।
*/
typedef void* पर्व;

/*
प्रयोज्यम्प्रयोगविषयेप्रयुज्यफलितम्पर्वप्रतिग्राहयति।
*/
पर्व नवप्रयोगः(const पर्व प्रयोज्यम्, const पर्व प्रयोगविषयः);

पर्व नवपर्व(const पर्व वामपर्व, const पर्व दक्षिणपर्व);

/*
पर्वपरम्पराम्प्रतिग्राहयति।
यस्यामुखव्ँवामकम्।
ततःक्रमेणदक्षिणकतद्रूपकसमत्वकस्थानिकातिदेशकप्रयोजकबाह्यकानि।
*/
पर्व मूलपर्व();

/*
मूलपर्वपरम्परायामुखम्।
अतोमूलस्यवामेवर्तते।
*/
पर्व वामकपर्व();

/*
मूलपरम्परायाःकायस्यमुखम्।
अतोमूलस्यदक्षिणस्यवामेवर्तते।
*/
पर्व दक्षिणकपर्व();

void मार्जनम्(const पर्व);

#endif
